require(['date.format'], function (dateFormat) {
    // Internationalization strings
    dateFormat.i18n = {
        dayNames: [
            "Вс", "Пн", "Вт", "Ср", "Чт", "Пт", "Сб",
            "Воскресенье", "Понедельник", "Вторник", "Среда", "Четверг", "Пятница", "Суббота"
        ],
        monthNames: [
            "Янв", "Фев", "Мар", "Апр", "Мая", "Июн", "Июл", "Авг", "Сен", "Окт", "Ноя", "Дек",
            "Января", "Февраля", "Марта", "Апреля", "Мая", "Июня", "Июля", "Августа", "Сентября", "Октября", "Ноября", "Декабря"
        ]
    };
});
